@echo off
echo #######################################################
echo   .tgaファイルを元にmp4ファイルを作成
echo #######################################################
echo;

cd /D %~dp0

rem ----------------------------------
rem 開始番号入力
rem ----------------------------------
set START_NUMBER=000000
set /P START_NUMBER="連番ファイル開始番号を入力してください: "
echo;

echo -------------------------------------------------------
echo %START_NUMBER%.tga 以降の連番で作成します。
echo よろしいですか？
echo -------------------------------------------------------
pause
echo;

rem ----------------------------------
rem ファイル名生成 YYYYMMDDHHMMSS
rem ----------------------------------
set FILE_NAME=%~dp0/mp4/%date:~0,4%%date:~5,2%%date:~8,2%%time:~0,2%%time:~3,2%%time:~6,2%.mp4

rem ----------------------------------
rem 入力 .tgp ファイル
rem ----------------------------------
set TGA_FILE=%~dp0/tga/%%06d.tga

rem ----------------------------------
rem ffmpegコマンド実行
rem ----------------------------------
ffmpeg.exe -start_number %START_NUMBER% -framerate 30 -i %TGA_FILE% -r 30 -an -vcodec libx264 -pix_fmt yuv420p %FILE_NAME%
echo;

echo -------------------------------------------------------
echo %FILE_NAME%を作成しました
echo -------------------------------------------------------
echo;

pause
